Tekla Open API Reference for Tekla Structures 2025
PluginUserInterfaceAttribute Properties
The PluginUserInterfaceAttribute type exposes the following members.
Properties
Name | Description
Description
 The description of the plug-in user interface in inp format.
Top
See Also
Reference
PluginUserInterfaceAttribute Class
Tekla.Structures.Plugins Namespace